Applying **uat**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cloud_bucket["learn-gcpdevops-987654"].google_storage_bucket.bucket will be created
+   resource "google_storage_bucket" "bucket" {
+       force_destroy               = true
+       id                          = (known after apply)
+       labels                      = {
+           "app" = "gcs"
+           "env" = "uat"
        }
+       location                    = "ASIA-SOUTH1"
+       name                        = "learn-gcpdevops-987654"
+       project                     = "learn-gcp-devops-adarsh"
+       public_access_prevention    = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       encryption {
+           default_kms_key_name = "projects/learn-gcp-devops-adarsh/locations/asia-south1/keyRings/sample-keyring/cryptoKeys/test"
        }

+       lifecycle_rule {
+           action {
+               type = "Delete"
            }
+           condition {
+               age                   = 3
+               matches_prefix        = []
+               matches_storage_class = []
+               matches_suffix        = []
+               with_state            = (known after apply)
            }
        }

+       logging {
+           log_bucket        = "log-bucket"
+           log_object_prefix = (known after apply)
        }

+       versioning {
+           enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   bucket_id        = [
+       null,
    ]
+   bucket_name      = [
+       "learn-gcpdevops-987654",
    ]
+   bucket_self_link = [
+       null,
    ]
+   bucket_url       = [
+       null,
    ]
```

```
module.cloud_bucket["learn-gcpdevops-987654"].google_storage_bucket.bucket: Creating...
module.cloud_bucket["learn-gcpdevops-987654"].google_storage_bucket.bucket: Creation complete after 4s [id=learn-gcpdevops-987654]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

bucket_id = [
  "learn-gcpdevops-987654",
]
bucket_name = [
  "learn-gcpdevops-987654",
]
bucket_self_link = [
  "https://www.googleapis.com/storage/v1/b/learn-gcpdevops-987654",
]
bucket_url = [
  "gs://learn-gcpdevops-987654",
]

```